#+title: Org Mode and Homework
#+author: Nikhil Dhawan, MD
#+PROPERTY: header-args:python :exports both :results output :session 
#+date: 01-21-21

#+begin_src python :session :results output
import os
import csv
#+end_src

Here I am declaring dictionary lists to store the total votes and the percentages. Each candidate is the key for the dict file. The two dictionary lists are =totals= and =percentages= which will contain the total votes and the percentage of votes received for each candidate. 

#+begin_src python 
totals = {}
percentages = {}
#+end_src

For the four candidates Khan, O'Tooley, Li, and Correy, I am setting their total votes to 0. By setting the totals to 0, I am also declaring the variables. If you try to run the line src_python[:exports code]{totals["Khan"] = totals["Khan"] + 1} you will get an error, unless the key has been initiated. 

#+begin_src python

totals["Khan"] = 0
totals["O'Tooley"] = 0
totals["Li"] = 0
totals["Correy"] = 0
total_vote = 0

#+end_src

#+RESULTS:
: 
: 
: 

The following code opens election data csv file. Then each row is inputed into =csv_reader= which is a csv_reader object. You can think of it as an array of lists. Each list will contain a list of values that were separated by a comma. 

#+begin_src python 
csvpath = os.path.join("/home/nikd/Dropbox/jhw","Resources", "election_data.csv")  

with open(csvpath) as csvfile:
    csv_reader = csv.reader(csvfile, delimiter = ",")
    csv_header = next(csv_reader)

    for row in csv_reader:
        total_vote = total_vote + 1
        candidate = row[2]
        totals[candidate] += 1

    for candidate in totals:
        percentages[candidate] = totals[candidate] / total_vote * 100
        
    for candidate in totals:
        print(candidate, " Total = ", totals[candidate], " Percentage = ", percentages[candidate], "%")

print("Winner = ", max(totals, key=totals.get))
#+end_src

#+RESULTS:
: <class '_csv.reader'>
: Khan  Total =  3  Percentage =  100.0 %
: O'Tooley  Total =  0  Percentage =  0.0 %
: Li  Total =  0  Percentage =  0.0 %
: Correy  Total =  0  Percentage =  0.0 %
: Winner =  Khan
: 
: 
